from functions import *
import numpy as np

l = [['ID', 'Название', 'Категория', 'Цена закупки', 'Цена продажи', 'Количество проданного', 'Дата сделки\r'], ['1', 'HP V2', 'Монитор', '44,4', '55', '66', '14.03.2022\r'], ['1', 'HP V3', 'Монитор', '45', '56', '63', '15.03.2022\r'], ['1', 'HP V3', 'Монитор', '46', '60', '63', '16.03.2022\r'], ['2', 'Logitech G102', 'Компьютерная мышь', '33', '44', '55', '14.03.2022\r'], ['2', 'Logitech G102', 'Компьютерная мышь', '34', '45', '50', '15.03.2022\r'], ['2', 'Logitech G102', 'Компьютерная мышь', '35', '46', '46', '16.03.2022\r'], ['3', 'Lenovo', 'Камера наблюдения', '35', '46', '46', '13.02.2022']]

line = get_line(l)


